# 4.5: Data Consistency Checks

## 01. Import Libraries

In [63]:
import pandas as pd
import numpy as np
import os

## 02. Import Data

In [64]:
path = r'C:\Users\ThinkPad X250\Documents\Instacart Basket Analysis'

In [65]:
df_ords = pd.read_csv(r'C:\Users\ThinkPad X250\Documents\Instacart Basket Analysis\02 Data\Original Data\orders.csv', index_col = False)

In [66]:
df_prods = pd.read_csv(r'C:\Users\ThinkPad X250\Documents\Instacart Basket Analysis\02 Data\Original Data\products.csv', index_col = False)

## 03. Consistency Check - df_prods dataframe

##### 1.     Investigate

In [67]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

##### 2.	Check for mixed-type data

In [68]:
# Create a dataframe

df_test = pd.DataFrame()

In [69]:
# Create a mixed Type column

df_test['mix'] = ['a', 'b', 1, True]

In [70]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [71]:
# checking whether a dataframe contains any mixed-type columns

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

##### 2.1 Fixing mixed-type data

In [72]:
# changing data type 

df_test['mix'] = df_test['mix'].astype('str')

In [73]:
# checking whether a dataframe contains any mixed-type columns

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)
  else: print ('none')

none

##### 3.	Run a check for missing values

In [74]:
# Find the missing values

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [75]:
# List of missing values

df_prods_nan = df_prods[df_prods.product_name.isnull() == True]

In [76]:
df_prods_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

##### 3.1	Address the missing values

In [77]:
# Create a new variable that acts like a flag based on the missing value.

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [78]:
# check that the number of rows has decreased

df_prods_clean.shape

(49677, 5)

##### 4.	Check for duplicate values

In [79]:
# Create a new subset containing only rows that are duplicate

df_prods_dups = df_prods_clean[df_prods_clean.duplicated()]

##### 4.1 Addressing duplicate values

In [80]:
# check the current number of rows 

df_prods_clean.shape

(49677, 5)

In [81]:
# Create a dataframe that doesn't include the duplicates

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [82]:
# check the current number of rows 

df_prods_clean_no_dups.shape

(49672, 5)

## 03. Consistency Check - df_ords dataframe

##### Investigate

In [83]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

##### Mixed-typed Data

In [84]:
# Check for mixed-type data

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
        print (col, ' mixed')
  else: print(col, ' consistent')

##### --- No mixed-type data was found

order_id  consistent
user_id  consistent
eval_set  consistent
order_number  consistent
order_dow  consistent
order_hour_of_day  consistent
days_since_prior_order  consistent

##### Missing Values

In [85]:
# Check the missing values 

df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [86]:
# Creating a list missing values

df_ords_nan = df_ords [df_ords ['days_since_prior_order'].isnull () == True]

In [87]:
df_ords_nan

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

##### Duplicate Values

In [92]:
#Check for duplicate values

df_ords_dups = df_ords[df_ords.duplicated()]

In [93]:
# check the current number of rows 

df_ords_dups.size

0

##### Export

In [94]:
df_ords_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_consistent.csv'))

In [95]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'os.path.join(path, '02 Data','Prepared Data', 'departments_consistent.csv'))'))